/*
 * This profile builds public testing and development images.
 */
{
    /*
     * The AWS image created can be uploaded to, and tested on, a development
     * AWS account.
     * These credentials should have sufficient access to S3 and EC2 to create
     * a development image and to run the related tests.
     */
     "AWS_DEV_CREDS": "6d37d17c-503e-4596-9a9b-1ab4373955a9",
     "AWS_DEV_BUCKET": "s3://coreos-dev-ami-import-us-west-2",
     "AWS_REGION": "us-west-2",

    /*
     * The OS build ID should be changed when building with a different
     * manifest job, when reusing build numbers would cause conflicting
     * branch names in the manifest-builds repository.
     */
    "BUILD_ID_PREFIX": "jenkins2-",

    /*
     * The manifest-builds repository holds the manifest files for each
     * new build from Jenkins.  It creates new builds by pushing them
     * over SSH, and all the other jobs clone the repository.  The URL
     * for cloning does not need to be over SSH if it is public, and in
     * that case, its credentials ID can be omitted or left blank.
     */
    "BUILDS_CLONE_URL": "https://github.com/coreos/manifest-builds.git",
    "BUILDS_CLONE_CREDS": "",
    "BUILDS_PUSH_URL": "ssh://git@github.com/coreos/manifest-builds.git",
    "BUILDS_PUSH_CREDS": "3d4319c2-bca1-47c8-a483-2f355c249e30",

    /*
     * When creating build commits in the manifest-builds repository,
     * these values will be used for the author and committer.
     */
    "GIT_AUTHOR_EMAIL": "jenkins@jenkins-os.prod.coreos.systems",
    "GIT_AUTHOR_NAME": "CoreOS Jenkins",

    /*
     * The generated images must have a default update group.
     */
    "GROUP": "developer",

    /*
     * The built OS files are uploaded to Google Storage, and they are
     * downloaded by downstream jobs.  The development files such as
     * binary packages and the SDK image may use a different storage
     * location than the final OS images.
     */
    "GS_DEVEL_ROOT": "gs://builds.developer.core-os.net",
    "GS_DEVEL_CREDS": "jenkins-coreos-systems-write-5df31bf86df3.json",
    "GS_RELEASE_DOWNLOAD_ROOT": "gs://builds.developer.core-os.net",
    "GS_RELEASE_ROOT": "gs://builds.developer.core-os.net",
    "GS_RELEASE_CREDS": "jenkins-coreos-systems-write-5df31bf86df3.json",

    /*
     * This is the URL cloned by the os/manifest job to read the base
     * manifest files that define the OS build.
     */
    "MANIFEST_URL": "https://github.com/coreos/manifest.git",

    /*
     * All of the files resulting from the build (OS images, firmware,
     * digests, etc.) are signed with the following GPG key.  The given
     * credentials ID should point to the private key file to be used,
     * and the e-mail address identifies it to the GPG command.
     */
    "SIGNING_CREDS": "buildbot-official.1CB5FA26.subkey.gpg",
    "SIGNING_USER": "0x1CB5FA26!",

    /*
     * A GPG keyring must be given to verify signed objects throughout
     * the build.  It should provide the public keys of anyone that can
     * sign release tags, as well as the public key of the user defined
     * in SIGNING_USER above.  The value of VERIFY_KEYRING can be the
     * entire ASCII-armored keyring from "gpg2 --armor --export" (since
     * multi-line strings are supported here), or it can be given the
     * following special format to read the keyring from an artifact:
     *
     *     artifact:JOB_NAME:FILE_NAME
     *
     * JOB_NAME should be the name of the job providing the artifact,
     * including the full path with any parent folders.  FILE_NAME is
     * the name of the artifact including any leading path component,
     * which is taken from the last successful build.
     */
    "VERIFY_KEYRING": "artifact:/os/keyring:keyring.asc",
}
